Autodesk.Revit.Exceptions.OperationCanceledException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.OperationCanceledException
The exception that is thrown when an operation is unexpectedly cancelled.